Table of Contents
 Class ConProjectInfo
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides informationabout
[DataContract]
public class ConProjectInfo
Inheritance
object
ConProjectInfo
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Author
Name of the author
[DataMember]
public string Author { get; set; }
Property Value
string
 Connections
Connections in the project
[DataMember]
public List<ConnectionInfo> Connections { get; set; }
Property Value
List<ConnectionInfo>
 Date
Date
[DataMember]
public DateTime Date { get; set; }
Property Value
DateTime
 Description
The description of the project
[DataMember]
public string Description { get; set; }
Property Value
string
 DesignCode
Design code
[DataMember]
public string DesignCode { get; set; }
Property Value
string
 Name
The name of the project
[DataMember]
public string Name { get; set; }
Property Value
string
 ProjectNumber
Project number
[DataMember]
public string ProjectNumber { get; set; }
Property Value
string
 Edit this page